[View in Colaboratory](https://colab.research.google.com/github/baileylei/hello-word/blob/master/Dataframe_Tutorials.ipynb)

**Create an indexed DataFrame using arrays**

In [94]:
# Import libraries
import pandas as pd
import numpy as np

data = {"ClassA": [2,2,2,np.nan,2,2], "ClassB":[0,1,2,3,4,5], "ClassC":[0,1,np.nan,3,5,5]}

# Create dataframe
df = pd.DataFrame(data)
df

   ClassA  ClassB  ClassC
0     2.0       0     0.0
1     2.0       1     1.0
2     2.0       2     NaN
3     NaN       3     3.0
4     2.0       4     5.0
5     2.0       5     5.0

**Imputation** - Replacing/dropping missing data

In [95]:
#check NA values in df, True = NA values found
print(df.isnull().values.any())

#drop all rows that have any NaN values
df_clean = df.dropna()
df_clean

True

   ClassA  ClassB  ClassC
0     2.0       0     0.0
1     2.0       1     1.0
4     2.0       4     5.0
5     2.0       5     5.0

In [96]:
#Filling NaN with mean value of column
df_fmean = df.fillna(df.mean())
df_fmean

   ClassA  ClassB  ClassC
0     2.0       0     0.0
1     2.0       1     1.0
2     2.0       2     2.8
3     2.0       3     3.0
4     2.0       4     5.0
5     2.0       5     5.0

Imputation using the most common values.

In [100]:
#fillna with mode produce a series where iloc is needed to specify the position

df_fmode = df.fillna(df.mode().iloc[0])
df_fmode

   ClassA  ClassB  ClassC
0     2.0       0     0.0
1     2.0       1     1.0
2     2.0       2     5.0
3     2.0       3     3.0
4     2.0       4     5.0
5     2.0       5     5.0

**Selecting Subsets of Rows and Columns in Python**

We can select specific ranges of our data using label or indexing.

In [71]:
df[['ClassA', 'ClassB']]

   ClassA  ClassB
0       2       0
1       2       1
2       2       2
3       2       3
4       2       4
5       2       5

Indexing using 'dataframe.iloc' to get the last two column and the first row. 
Dataframe.iloc[row_start:row_stop, column_start:column_stop]

In [72]:
#Get the last two column and the first row.

df.iloc[0:1,1:]

   ClassB  ClassC
0       0     0.0

**Operations in DataFrame **

dataframe.mean() output the column mean while dataframe.mean(1) is the row mean.

In [73]:
#column mean
df.mean()

ClassA    2.0
ClassB    2.5
ClassC    2.8
dtype: float64

In [74]:
#row mean
df.mean(1)

0    0.666667
1    1.333333
2    2.000000
3    2.666667
4    3.666667
5    4.000000
dtype: float64

In [75]:
#create new column using existing column values
df['ClassAB'] = df.ClassA + df.ClassB

#operation on select column
df['ClassT'] = df.ClassA * 4

#remove column or row using df.drop('name', axis) where axis = 1 for column and 0 for row
df = df.drop('ClassC', 1)

df

   ClassA  ClassB  ClassAB  ClassT
0       2       0        2       8
1       2       1        3       8
2       2       2        4       8
3       2       3        5       8
4       2       4        6       8
5       2       5        7       8